MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MCXC242VLH/mcu.h
#define LLWU_PE1                      (*((volatile uint32_t *)0x4007C000))      // LLWU Pin Enable 1 register (LLWU_PE1)
#define LLWU_PE2                      (*((volatile uint32_t *)0x4007C001))      // LLWU Pin Enable 2 register (LLWU_PE2)
#define LLWU_PE3                      (*((volatile uint32_t *)0x4007C002))      // LLWU Pin Enable 3 register (LLWU_PE3)
#define LLWU_PE4                      (*((volatile uint32_t *)0x4007C003))      // LLWU Pin Enable 4 register (LLWU_PE4)
#define LLWU_ME                       (*((volatile uint32_t *)0x4007C004))      // LLWU Module Enable register (LLWU_ME)
#define LLWU_F1                       (*((volatile uint32_t *)0x4007C005))      // LLWU Flag 1 register (LLWU_F1)
#define LLWU_F2                       (*((volatile uint32_t *)0x4007C006))      // LLWU Flag 2 register (LLWU_F2)
#define LLWU_F3                       (*((volatile uint32_t *)0x4007C007))      // LLWU Flag 3 register (LLWU_F3)
#define LLWU_FILT1                    (*((volatile uint32_t *)0x4007C008))      // LLWU Pin Filter 1 register (LLWU_FILT1)
#define LLWU_FILT2                    (*((volatile uint32_t *)0x4007C009))      // LLWU Pin Filter 2 register (LLWU_FILT2)


//*****************************************************************************
//
// Direct Memory Access Multiplexer (DMAMUX) registers
//
//*****************************************************************************

#define DMAMUX0_CHCFG0                (*((volatile uint32_t *)0x40021000))      // Channel Configuration register
#define DMAMUX0_CHCFG1                (*((volatile uint32_t *)0x40021001))      // Channel Configuration register
#define DMAMUX0_CHCFG2                (*((volatile uint32_t *)0x40021002))      // Channel Configuration register
#define DMAMUX0_CHCFG3                (*((volatile uint32_t *)0x40021003))      // Channel Configuration register


//*****************************************************************************
//
// Reset Control Module (RCM) registers
//
//*****************************************************************************

#define RCM_SRS0                      (*((volatile uint32_t *)0x4007F000))      // System Reset Status Register 0
#define RCM_SRS1                      (*((volatile uint32_t *)0x4007F001))      // System Reset Status Register 1
#define RCM_RPFC                      (*((volatile uint32_t *)0x4007F004))      // Reset Pin Filter Control register
#define RCM_RPFW                      (*((volatile uint32_t *)0x4007F005))      // Reset Pin Filter Width register
#define RCM_FM                        (*((volatile uint32_t *)0x4007F006))      // Force Mode Register
#define RCM_MR                        (*((volatile uint32_t *)0x4007F007))      // Mode Register
#define RCM_SSRS0                     (*((volatile uint32_t *)0x4007F008))      // Sticky System Reset Status Register 0
#define RCM_SSRS1                     (*((volatile uint32_t *)0x4007F009))      // Sticky System Reset Status Register 1


//*****************************************************************************
//
// DMA Controller Module registers
//
//*****************************************************************************

#define DMA_SAR0                      (*((volatile uint32_t *)0x40008100))      // Source Address Register
#define DMA_DAR0                      (*((volatile uint32_t *)0x40008104))      // Destination Address Register
#define DMA_DSR_BCR0                  (*((volatile uint32_t *)0x40008108))      // DMA Status Register / Byte Count Register
#define DMA_DCR0                      (*((volatile uint32_t *)0x4000810C))      // DMA Control Register
#define DMA_SAR1                      (*((volatile uint32_t *)0x40008110))      // Source Address Register
#define DMA_DAR1                      (*((volatile uint32_t *)0x40008114))      // Destination Address Register
#define DMA_DSR_BCR1                  (*((volatile uint32_t *)0x40008118))      // DMA Status Register / Byte Count Register
#define DMA_DCR1                      (*((volatile uint32_t *)0x4000811C))      // DMA Control Register
#define DMA_SAR2                      (*((volatile uint32_t *)0x40008120))      // Source Address Register
#define DMA_DAR2                      (*((volatile uint32_t *)0x40008124))      // Destination Address Register
#define DMA_DSR_BCR2                  (*((volatile uint32_t *)0x40008128))      // DMA Status Register / Byte Count Register
#define DMA_DCR2                      (*((volatile uint32_t *)0x4000812C))      // DMA Control Register
#define DMA_SAR3                      (*((volatile uint32_t *)0x40008130))      // Source Address Register
#define DMA_DAR3                      (*((volatile uint32_t *)0x40008134))      // Destination Address Register
#define DMA_DSR_BCR3                  (*((volatile uint32_t *)0x40008138))      // DMA Status Register / Byte Count Register
#define DMA_DCR3                      (*((volatile uint32_t *)0x4000813C))      // DMA Control Register


//*****************************************************************************
//
// Miscellaneous Control Module (MCM) registers
//
//*****************************************************************************

#define MCM_PLASC                     (*((volatile uint32_t *)0xF0003008))      // Crossbar Switch (AXBS) Slave Configuration
#define MCM_PLAMC                     (*((volatile uint32_t *)0xF000300A))      // Crossbar Switch (AXBS) Master Configuration
#define MCM_PLACR                     (*((volatile uint32_t *)0xF000300C))      // Platform Control Register
#define MCM_CPO                       (*((volatile uint32_t *)0xF0003040))      // Compute Operation Control Register


//*****************************************************************************
//
// Timer/PWM Module (TPM) registers
//
//*****************************************************************************

#define TPM0_SC                       (*((volatile uint32_t *)0x40038000))      // Status and Control (TPM0_SC)
#define TPM0_CNT                      (*((volatile uint32_t *)0x40038004))      // Counter (TPM0_CNT)
#define TPM0_MOD                      (*((volatile uint32_t *)0x40038008))      // Modulo (TPM0_MOD)
#define TPM0_C0SC                     (*((volatile uint32_t *)0x4003800C))      // Channel (n) Status and Control (TPM0_C0SC)
#define TPM0_C0V                      (*((volatile uint32_t *)0x40038010))      // Channel (n) Value (TPM0_C0V)
#define TPM0_C1SC                     (*((volatile uint32_t *)0x40038014))      // Channel (n) Status and Control (TPM0_C1SC)
#define TPM0_C1V                      (*((volatile uint32_t *)0x40038018))      // Channel (n) Value (TPM0_C1V)
#define TPM0_C2SC                     (*((volatile uint32_t *)0x4003801C))      // Channel (n) Status and Control (TPM0_C2SC)
#define TPM0_C2V                      (*((volatile uint32_t *)0x40038020))      // Channel (n) Value (TPM0_C2V)
#define TPM0_C3SC                     (*((volatile uint32_t *)0x40038024))      // Channel (n) Status and Control (TPM0_C3SC)
#define TPM0_C3V                      (*((volatile uint32_t *)0x40038028))      // Channel (n) Value (TPM0_C3V)
#define TPM0_C4SC                     (*((volatile uint32_t *)0x4003802C))      // Channel (n) Status and Control (TPM0_C4SC)
#define TPM0_C4V                      (*((volatile uint32_t *)0x40038030))      // Channel (n) Value (TPM0_C4V)
#define TPM0_C5SC                     (*((volatile uint32_t *)0x40038034))      // Channel (n) Status and Control (TPM0_C5SC)
#define TPM0_C5V                      (*((volatile uint32_t *)0x40038038))      // Channel (n) Value (TPM0_C5V)
#define TPM0_STATUS                   (*((volatile uint32_t *)0x40038050))      // Capture and Compare Status (TPM0_STATUS)
#define TPM0_POL                      (*((volatile uint32_t *)0x40038070))      // Channel Polarity (TPM0_POL)
#define TPM0_CONF                     (*((volatile uint32_t *)0x40038084))      // Configuration (TPM0_CONF)
#define TPM1_SC                       (*((volatile uint32_t *)0x40039000))      // Status and Control (TPM1_SC)
#define TPM1_CNT                      (*((volatile uint32_t *)0x40039004))      // Counter (TPM1_CNT)
#define TPM1_MOD                      (*((volatile uint32_t *)0x40039008))      // Modulo (TPM1_MOD)
#define TPM1_C0SC                     (*((volatile uint32_t *)0x4003900C))      // Channel (n) Status and Control (TPM1_C0SC)
#define TPM1_C0V                      (*((volatile uint32_t *)0x40039010))      // Channel (n) Value (TPM1_C0V)
#define TPM1_C1SC                     (*((volatile uint32_t *)0x40039014))      // Channel (n) Status and Control (TPM1_C1SC)
#define TPM1_C1V                      (*((volatile uint32_t *)0x40039018))      // Channel (n) Value (TPM1_C1V)
#define TPM1_C2SC                     (*((volatile uint32_t *)0x4003901C))      // Channel (n) Status and Control (TPM1_C2SC)
#define TPM1_C2V                      (*((volatile uint32_t *)0x40039020))      // Channel (n) Value (TPM1_C2V)
#define TPM1_C3SC                     (*((volatile uint32_t *)0x40039024))      // Channel (n) Status and Control (TPM1_C3SC)
#define TPM1_C3V                      (*((volatile uint32_t *)0x40039028))      // Channel (n) Value (TPM1_C3V)
#define TPM1_C4SC                     (*((volatile uint32_t *)0x4003902C))      // Channel (n) Status and Control (TPM1_C4SC)
#define TPM1_C4V                      (*((volatile uint32_t *)0x40039030))      // Channel (n) Value (TPM1_C4V)
#define TPM1_C5SC                     (*((volatile uint32_t *)0x40039034))      // Channel (n) Status and Control (TPM1_C5SC)
#define TPM1_C5V                      (*((volatile uint32_t *)0x40039038))      // Channel (n) Value (TPM1_C5V)
#define TPM1_STATUS                   (*((volatile uint32_t *)0x40039050))      // Capture and Compare Status (TPM1_STATUS)
#define TPM1_POL                      (*((volatile uint32_t *)0x40039070))      // Channel Polarity (TPM1_POL)
#define TPM1_CONF                     (*((volatile uint32_t *)0x40039084))      // Configuration (TPM1_CONF)
#define TPM2_SC                       (*((volatile uint32_t *)0x4003A000))      // Status and Control (TPM2_SC)
#define TPM2_CNT                      (*((volatile uint32_t *)0x4003A004))      // Counter (TPM2_CNT)
#define TPM2_MOD                      (*((volatile uint32_t *)0x4003A008))      // Modulo (TPM2_MOD)
#define TPM2_C0SC                     (*((volatile uint32_t *)0x4003A00C))      // Channel (n) Status and Control (TPM2_C0SC)
#define TPM2_C0V                      (*((volatile uint32_t *)0x4003A010))      // Channel (n) Value (TPM2_C0V)
#define TPM2_C1SC                     (*((volatile uint32_t *)0x4003A014))      // Channel (n) Status and Control (TPM2_C1SC)
#define TPM2_C1V                      (*((volatile uint32_t *)0x4003A018))      // Channel (n) Value (TPM2_C1V)
#define TPM2_C2SC                     (*((volatile uint32_t *)0x4003A01C))      // Channel (n) Status and Control (TPM2_C2SC)
#define TPM2_C2V                      (*((volatile uint32_t *)0x4003A020))      // Channel (n) Value (TPM2_C2V)
#define TPM2_C3SC                     (*((volatile uint32_t *)0x4003A024))      // Channel (n) Status and Control (TPM2_C3SC)
#define TPM2_C3V                      (*((volatile uint32_t *)0x4003A028))      // Channel (n) Value (TPM2_C3V)
#define TPM2_C4SC                     (*((volatile uint32_t *)0x4003A02C))      // Channel (n) Status and Control (TPM2_C4SC)
#define TPM2_C4V                      (*((volatile uint32_t *)0x4003A030))      // Channel (n) Value (TPM2_C4V)
#define TPM2_C5SC                     (*((volatile uint32_t *)0x4003A034))      // Channel (n) Status and Control (TPM2_C5SC)
#define TPM2_C5V                      (*((volatile uint32_t *)0x4003A038))      // Channel (n) Value (TPM2_C5V)
#define TPM2_STATUS                   (*((volatile uint32_t *)0x4003A050))      // Capture and Compare Status (TPM2_STATUS)
#define TPM2_POL                      (*((volatile uint32_t *)0x4003A070))      // Channel Polarity (TPM2_POL)
#define TPM2_CONF                     (*((volatile uint32_t *)0x4003A084))      // Configuration (TPM2_CONF)


//*****************************************************************************
//
// Analog-to-Digital Converter (ADC) registers
//
//*****************************************************************************

